In [ ]:
#You start by import pandas, as well as Series and DataFrame

In [32]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

#create a Series called CityPopulation

In [3]:
CityPopulation = pd.Series([2,4,1,4,5])
CityPopulation
CityPopulation.index = ['City', 'Man', 'Spurs', 'Gunners', 'Wolves']
CityPopulation

City       2
Man        4
Spurs      1
Gunners    4
Wolves     5
dtype: int64

#You can get the values in a series by using the dot values function
#The dot index function retuns the range of index of your values

In [4]:
CityPopulation.values
CityPopulation.index

Index(['City', 'Man', 'Spurs', 'Gunners', 'Wolves'], dtype='object')

#Matching Series with String index that explains data point

In [5]:
CityPopulation = pd.Series([10,6,8,7,10], index = ['New York', 'Florida', 'Atlanta', 'Charlotte','San Francisco'])
CityPopulation
CityPopulation.index
CityPopulation['New York']  #Use Index to find corresponding number 
CityPopulation ['New York'] = 15 #Use Index to update correspongding number
CityPopulation

New York         15
Florida           6
Atlanta           8
Charlotte         7
San Francisco    10
dtype: int64

In [6]:
CityPopulation[CityPopulation >8] #Filter Cities Population Greater than 8 million
print(CityPopulation [1:4] + 3)  #Project that each city will add 3 million people over a 30 year period
print(CityPopulation ['New York'] * 2) #New York will however double in size
CityPopulation

Florida       9
Atlanta      11
Charlotte    10
dtype: int64
30

New York         15
Florida           6
Atlanta           8
Charlotte         7
San Francisco    10
dtype: int64

In [7]:
#Give the object and its index.

In [8]:
CityPopulation.name = '2010 Population'
CityPopulation.index.name = 'Big Cities'

In [9]:
CityPopulation

Big Cities
New York         15
Florida           6
Atlanta           8
Charlotte         7
San Francisco    10
Name: 2010 Population, dtype: int64

In [10]:
#Creating DataFrames

In [11]:
data = {'State': ['New York', 'California', 'Georgia', 'North Carolina'],
        'Counties': ['40', '36', '22', '15'],
        'Population' : ['10' ,'8', '6', '3']
       }

Cities = pd.DataFrame(data)
Cities

            State Counties Population
0        New York       40         10
1      California       36          8
2         Georgia       22          6
3  North Carolina       15          3

In [15]:
Cities.head()
Cities = pd.DataFrame(data, columns = (['State','Population', 'Counties']))
Cities

            State Population Counties
0        New York         10       40
1      California          8       36
2         Georgia          6       22
3  North Carolina          3       15

In [ ]:
#Add new column called income to the city data, when added, the row values for the income field will be Nan aka Null

In [16]:
Cities = pd.DataFrame(data, columns = ['State','Population', 'Counties',"Income"], index = ['East','West','SouthEast','South'])
Cities

                    State Population Counties Income
East             New York         10       40    NaN
West           California          8       36    NaN
SouthEast         Georgia          6       22    NaN
South      North Carolina          3       15    NaN

In [49]:
Cities['income'] = range(1,5)  #Use range function to pass values to the null field
Cities['SuperBowls'] = [1,3,6, 8] # Use the index option to pass values null or new fields
Cities['Income'] = np.arange(4)
Cities

                    State Population Counties  Income  SuperBowls  income
Location
East             New York         10       40       0           1       1
West           California          8       36       1           3       2
SouthEast         Georgia          6       22       2           6       3
South      North Carolina          3       15       3           8       4

In [50]:
del Cities['income']  #Use del function to delete unwanted columns 
Cities

                    State Population Counties  Income  SuperBowls
Location
East             New York         10       40       0           1
West           California          8       36       1           3
SouthEast         Georgia          6       22       2           6
South      North Carolina          3       15       3           8

In [28]:
Cities['State']
print(Cities.T )  #Transpose the Cities dataframe

Location        East        West SouthEast           South
State       New York  California   Georgia  North Carolina
Population        10           8         6               3
Counties          40          36        22              15
Income           NaN         NaN       NaN             NaN

In [51]:
#If the nested dict is passed to the DataFrame, pandas will interpret the 
#outer dict keys as the columns and the inner keys as the row indices:

In [52]:
Cities

                    State Population Counties  Income  SuperBowls
Location
East             New York         10       40       0           1
West           California          8       36       1           3
SouthEast         Georgia          6       22       2           6
South      North Carolina          3       15       3           8

In [19]:
Cities.index.name = 'Location'  #Give the index a name called location 
Cities

                    State Population Counties Income
Location
East             New York         10       40    NaN
West           California          8       36    NaN
SouthEast         Georgia          6       22    NaN
South      North Carolina          3       15    NaN

In [27]:
Cities.columns
Cities.index[1:3]

Index(['West', 'SouthEast'], dtype='object', name='Location')

In [ ]:
##Reindexing

In [60]:
print(Cities.reindex(['East','West','South','SouthEast'])) #Reindex allows you to modify the initial index of  your data if order matters

                    State Population Counties  Income  SuperBowls
Location
East             New York         10       40       0           1
West           California          8       36       1           3
South      North Carolina          3       15       3           8
SouthEast         Georgia          6       22       2           6

In [65]:
State =  ['New York', 'California', 'Georgia', 'North Carolina'] 
Cities.reindex(columns = State)  #Reindex using keywords as columns and specifying the workd 'Colunms' in the index bracket

           New York  California  Georgia  North Carolina
Location
East            NaN         NaN      NaN             NaN
West            NaN         NaN      NaN             NaN
SouthEast       NaN         NaN      NaN             NaN
South           NaN         NaN      NaN             NaN

In [ ]:
#Use drop function to take out unwanted columns or index

In [69]:
Cities.drop('SouthEast') #Use the drop function to take out unwanted row 
Cities.drop(columns = 'SuperBowls') #Use the drop function with columns specified to take out unwanted columns

                    State Population Counties  Income
Location
East             New York         10       40       0
West           California          8       36       1
SouthEast         Georgia          6       22       2
South      North Carolina          3       15       3

In [79]:
#Create a new data frame combining Numpy's arange and reshape, Pandas' index and columns 

data = pd.DataFrame(np.arange(20).reshape(4,5), index = ['good', 'better', 'best', 'great'], 
                    columns = ['Cup','league','Europa', 'UCL', 'World Cup']
                   )
data

        Cup  league  Europa  UCL  World Cup
good      0       1       2    3          4
better    5       6       7    8          9
best     10      11      12   13         14
great    15      16      17   18         19

In [80]:
data.drop(['good', 'great']) #You can drop multiples indexes using the drop tool as well

        Cup  league  Europa  UCL  World Cup
better    5       6       7    8          9
best     10      11      12   13         14

In [ ]:
#Slicing and Filtering

In [96]:
Exams =  pd.Series([98, 88, 74, 92, 60], index = ['Maths', 'Sci', 'Eng', 'Soc', 'Lin'])
Exams

Maths    98
Sci      88
Eng      74
Soc      92
Lin      60
dtype: int64

In [107]:
Exams['Maths':'Eng'] #You can index using string keywords, only works for a 1x1 series
Exams[Exams > 90] #You can index by specifying a logic or a mathematical argument 
Exams['Maths':'Eng'] = 89 # You can index/slice using a string a pass a value to the respective columns 
Exams

Maths    89
Sci      89
Eng      89
Soc      92
Lin      60
dtype: int64

In [ ]:
#Data Alignment

In [127]:
firstquarter = pd.Series(np.arange(20))
secondquarter = pd.Series(range(21))
firstquarter
secondquarter 

firstquarter + secondquarter #You can align two data sets by align them...data with same index get added together. 
                             #mismatching or non-overlaping index returns NaN

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
11    22.0
12    24.0
13    26.0
14    28.0
15    30.0
16    32.0
17    34.0
18    36.0
19    38.0
20     NaN
dtype: float64

In [131]:
Exams.sum() #You can get the sum of a series using the sum function
Exams.mean() #You can get the mean of a series using the mean function

Income        1.5
SuperBowls    4.5
dtype: float64

In [139]:
Cities
Cities.mean() #you can get the average of individual columns in a dataframe

Income        1.5
SuperBowls    4.5
dtype: float64

In [142]:
Cities.mean(axis = 'columns') #You can use 'skipna = False' to include null values, null values are removed by default

Location
East         0.5
West         2.0
SouthEast    4.0
South        5.5
dtype: float64

In [145]:
Cities.describe() #You can use the describe function to get the overall summary of your series or data frame

count    20.00000
mean      9.50000
std       5.91608
min       0.00000
25%       4.75000
50%       9.50000
75%      14.25000
max      19.00000
dtype: float64

In [147]:
firstquarter.unique() #The unique functions returns unique values in a series

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19], dtype=int64)